'''GIT - это система контроля версий (записывает изменение файла или нобора файлов в течении времени). Предназначен для отслеживание ведение истории изменнений файлов в проекте. Блогодаря ему, можем вернуть старую версию прогрпммы'''

'''github - это онлайн сервис, предлогает услуги по хранению репозиториев и управление доступом'''

'''команды'''
# git init -> это иницализация нашего объекта и создание папки .git(в ней содержиться все необходимые файлы нашего репозитория)
# git add (./<filename>) -> добавляет файлы с рабочей директории в промежуточное пространство - индекс (специальное промежуточное простраство, в котором хроняться изменения файлов на пути от рабочей папки до репозитория)

# git commit -> 